database/load-stress-scripts/test.yml
config:
  target: 'http://localhost:3001/map-and-images/business'
  phases: 
    - duration: 120
      arrivalRate: 25 
  processor: './randomizer.js'
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - loop:
      - function: "generateRandomData"
      - get:
          url: "/{{ url }}"
      - get: 
          url: "/{{ url }}/photos"
      count: 60