database/load-stress-scripts/test.yml
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 20
      arrivalRate: 1000
  processor: './randomizer.js'
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - function: "generateRandomData"
    - get:
        url: "/{{ url }}"
    - log: "Get id: {{ url }}"